In [2]:
import pandas as pd

In [3]:
ratings = pd.read_csv('data/movielens/ratings.csv')
movies = pd.read_csv('data/movielens/movies.csv')
movies.set_index('movieId',inplace=True)
movies.head(5)

,title,genres
movieId,,
1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
2,Jumanji (1995),Adventure|Children|Fantasy
3,Grumpier Old Men (1995),Comedy|Romance
4,Waiting to Exhale (1995),Comedy|Drama|Romance
5,Father of the Bride Part II (1995),Comedy

In [21]:
print ('ratings')
ratings.head()

ratings

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

# Independent Recommendation
In this case we are only interested in top 10 movies

In [4]:
top5movies = ratings[['movieId','rating']].groupby('movieId').mean().sort_values('rating').tail(5)
top5movies.head()
top5movies['moviename'] = top5movies.index.map(lambda mid : movies.loc[mid,'title'])

In [47]:
top5movies

         rating                                          moviename
movieId
3165        5.0                               Boiling Point (1993)
27792       5.0             Saddest Music in the World, The (2003)
3202        5.0  Even Dwarfs Started Small (Auch Zwerge haben k...
3216        5.0             Vampyros Lesbos (Vampiras, Las) (1971)
163949      5.0  The Beatles: Eight Days a Week - The Touring Y...

## Collaborative Filtering - Item Item Similarity

In [5]:
movie_users = ratings[['movieId','rating','userId']].groupby('movieId')['userId'].apply(list)
movie_users

movieId
1         [7, 9, 13, 15, 19, 20, 23, 26, 30, 37, 43, 44,...
2         [15, 19, 30, 32, 41, 47, 48, 49, 61, 68, 69, 7...
3         [5, 19, 25, 44, 70, 75, 85, 100, 110, 112, 115...
4         [19, 113, 128, 168, 182, 239, 391, 460, 461, 5...
5         [15, 18, 44, 55, 69, 70, 85, 98, 110, 111, 113...
6         [15, 17, 18, 19, 23, 24, 30, 34, 36, 39, 44, 5...
7         [18, 19, 55, 70, 79, 80, 87, 88, 100, 110, 111...
8                                  [30, 113, 128, 182, 614]
9         [18, 19, 55, 70, 95, 110, 113, 182, 247, 254, ...
10        [2, 4, 7, 15, 19, 21, 39, 47, 50, 56, 73, 74, ...
11        [15, 19, 23, 30, 57, 58, 59, 63, 68, 86, 88, 9...
12        [67, 70, 91, 157, 199, 247, 252, 284, 294, 358...
13                 [182, 213, 287, 402, 516, 518, 564, 595]
14        [15, 18, 19, 30, 70, 86, 102, 233, 256, 266, 2...
15        [73, 213, 311, 390, 396, 409, 496, 564, 598, 6...
16        [15, 19, 23, 30, 36, 38, 39, 56, 60, 63, 67, 7...
17        [2, 9, 15, 18, 44, 57, 67, 70, 74, 86, 93, 99,...
18        [18, 30, 36, 67, 86, 111, 112, 135, 154, 177, ...
19        [15, 23, 32, 33, 58, 69, 73, 85, 86, 91, 92, 9...
20        [23, 80, 113, 135, 168, 253, 311, 388, 416, 45...
21        [7, 15, 19, 21, 28, 30, 34, 36, 39, 50, 56, 57...
22        [15, 19, 39, 66, 105, 165, 177, 188, 242, 245,...
23        [19, 30, 85, 91, 110, 150, 177, 199, 203, 254,...
24        [23, 35, 95, 113, 119, 180, 185, 188, 207, 213...
25        [15, 17, 18, 19, 30, 36, 44, 70, 73, 80, 86, 8...
26                                    [9, 70, 86, 119, 294]
27                      [135, 311, 412, 452, 487, 496, 641]
28        [67, 86, 99, 102, 122, 212, 224, 280, 294, 311...
29        [17, 19, 41, 56, 86, 90, 103, 119, 134, 148, 1...
30        [86, 224, 236, 409, 492, 509, 516, 564, 608, 636]
                                ...
158238                                             [15, 73]
158314                                                [655]
158528                                                 [15]
158956                                                [298]
159093                                            [15, 277]
159462                                                 [73]
159690                                                 [15]
159755                                                 [15]
159858                                             [15, 73]
159972                                                 [15]
160080                                                 [15]
160271                                                 [15]
160438                                            [62, 287]
160440                                                [624]
160563                                            [15, 287]
160565                                                 [15]
160567                                                 [15]
160590                                                 [56]
160656                                                [547]
160718                                                [547]
161084                                                [547]
161155                                                 [15]
161594                                                 [73]
161830                                                [624]
161918                                                [624]
161944                                                [287]
162376                                                 [73]
162542                                                [611]
162672                                                [611]
163949                                                [547]
Name: userId, Length: 9066, dtype: object

In [80]:
def find_similar(movieId):
    movie_users_cp = movie_users
    users = movie_users_cp[movieId]
    commons = movie_users_cp.map(lambda x : len(set(x).intersection(set(users))))
    #print (commons.sort_values()[-6:-1])
    top_results=commons.sort_values()[-2:-7:-1]
    print ('You searched : ',movies.loc[movieId,'title'])
    print ('\n Top Results : ')
    for topId,count in top_results.iteritems():
        print (count,movies.loc[topId,'title'])
    
find_similar(1200)

You searched :  Aliens (1986)

 Top Results :
101 Star Wars: Episode V - The Empire Strikes Back (1980)
100 Star Wars: Episode IV - A New Hope (1977)
94 Back to the Future (1985)
93 Raiders of the Lost Ark (Indiana Jones and the Raiders of the Lost Ark) (1981)
91 Matrix, The (1999)

In [101]:
actual = ratings.groupby('movieId').agg({'userId': lambda x : list(x),
                                        'rating': lambda x : list(x)})
actual_group = ratings.groupby('movieId')

In [100]:
actual.head(5)

,rating,userId
movieId,,
1,"[3.0, 4.0, 5.0, 2.0, 3.0, 3.5, 3.0, 5.0, 4.0, ...","[7, 9, 13, 15, 19, 20, 23, 26, 30, 37, 43, 44,..."
2,"[2.0, 3.0, 2.0, 4.0, 3.5, 5.0, 3.5, 5.0, 3.5, ...","[15, 19, 30, 32, 41, 47, 48, 49, 61, 68, 69, 7..."
3,"[4.0, 3.0, 3.0, 5.0, 5.0, 3.0, 2.0, 4.0, 4.0, ...","[5, 19, 25, 44, 70, 75, 85, 100, 110, 112, 115..."
4,"[3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 2.0, 3.5, 1.5, ...","[19, 113, 128, 168, 182, 239, 391, 460, 461, 5..."
5,"[4.5, 3.0, 3.0, 3.0, 5.0, 5.0, 3.0, 3.0, 4.0, ...","[15, 18, 44, 55, 69, 70, 85, 98, 110, 111, 113..."

In [115]:
user_df1 = actual_group.get_group(1)[['userId','rating']].set_index('userId')
user_df1['rating'][:5]

userId
7     3.0
9     4.0
13    5.0
15    2.0
19    3.0
Name: rating, dtype: float64

In [139]:
import numpy as np
def get_similarity(movieId1,movieId2):
    user_df1 = actual_group.get_group(movieId1)[['userId','rating']].set_index('userId')
    user_series1=user_df1['rating']
    user_df2 = actual_group.get_group(movieId2)[['userId','rating']].set_index('userId')
    user_series2=user_df2['rating']
    combined_df = pd.DataFrame({'movie1':user_series1,'movie2':user_series2})
    combined_df.dropna(inplace=True)
    return np.mean(np.array(combined_df['movie1']-2.5)*np.array(combined_df['movie2']-2.5))
 
sim_dict={}
def get_similar(movieId):
    sim_dict={key:get_similarity(movieId,key) for key in actual_group.groups.keys()}
    print(pd.Series(sim_dict).dropna().sort_values()[-5:])

In [140]:
get_similar(1)

C:\Users\jaley\AppData\Local\conda\conda\envs\condaenv\lib\site-packages\numpy\core\fromnumeric.py:2920: RuntimeWarning: Mean of empty slice.
  out=out, **kwargs)
C:\Users\jaley\AppData\Local\conda\conda\envs\condaenv\lib\site-packages\numpy\core\_methods.py:85: RuntimeWarning: invalid value encountered in double_scalars
  ret = ret.dtype.type(ret / rcount)

95313    6.25
95377    6.25
264      6.25
36931    6.25
3718     6.25
dtype: float64